
const sharedChannel = [
    "그란플로리스 1채널", "그란플로리스 2채널", "그란플로리스 3채널", "그란플로리스 4채널", "그란플로리스 5채널",
    "그란플로리스 6채널", "그란플로리스 7채널", "그란플로리스 8채널", "그란플로리스 9채널", "그란플로리스 10채널",
    "그란플로리스 11채널", "그란플로리스 12채널", "그란플로리스 13채널", "그란플로리스 14채널", "그란플로리스 15채널",
    "하늘성 1채널", "하늘성 2채널", "하늘성 3채널", "하늘성 4채널", "하늘성 5채널",
    "하늘성 6채널", "하늘성 7채널", "하늘성 8채널", "하늘성 9채널", "하늘성 10채널",
    "베히모스 11채널", "베히모스 12채널", "베히모스 13채널", "베히모스 14채널", "베히모스 15채널",
    "베히모스 16채널", "베히모스 17채널", "베히모스 18채널", "베히모스 19채널", "베히모스 20채널",
    "알프라이라 1채널", "알프라이라 2채널", "알프라이라 3채널", "알프라이라 4채널", "알프라이라 5채널",
    "노이어페라 6채널", "노이어페라 7채널", "노이어페라 8채널", "노이어페라 9채널", "노이어페라 10채널",
    "설산 11채널", "설산 12채널", "설산 13채널", "설산 14채널", "설산 15채널",
    "노스마이어 16채널", "노스마이어 17채널", "노스마이어 18채널", "노스마이어 19채널", "노스마이어 20채널",
    "아브노바 16채널", "아브노바 17채널", "아브노바 18채널", "아브노바 19채널", "아브노바 20채널",
    "멜트다운 21채널", "멜트다운 22채널", "멜트다운 23채널", "멜트다운 24채널", "멜트다운 25채널",
    "역천의 폭포 16채널", "역천의 폭포 17채널", "역천의 폭포 18채널", "역천의 폭포 19채널", "역천의 폭포 20채널",
    "인베트르 협곡 1채널", "인베트르 협곡 2채널", "인베트르 협곡 3채널", "인베트르 협곡 4채널", "인베트르 협곡 5채널",
    "인베트르 협곡 6채널", "인베트르 협곡 7채널", "인베트르 협곡 8채널", "인베트르 협곡 9채널", "인베트르 협곡 10채널",
    "해상열차 1채널", "해상열차 2채널", "해상열차 3채널", "해상열차 4채널", "해상열차 5채널",
    "시간의 문 11채널", "시간의 문 12채널", "시간의 문 13채널", "시간의 문 14채널", "시간의 문 15채널",
    "시간의 문 16채널", "시간의 문 17채널", "시간의 문 18채널", "시간의 문 19채널", "시간의 문 20채널",
    "파워스테이션 21채널", "파워스테이션 22채널", "파워스테이션 23채널", "파워스테이션 24채널", "파워스테이션 25채널",
    "노블스카이 1채널", "노블스카이 2채널", "노블스카이 3채널", "노블스카이 4채널", "노블스카이 5채널",
    "노블스카이 6채널", "노블스카이 7채널", "노블스카이 8채널", "노블스카이 9채널", "노블스카이 10채널",
    "죽읜자의 성 11채널", "죽읜자의 성 12채널", "죽읜자의 성 13채널", "죽읜자의 성 14채널", "죽읜자의 성 15채널",
    "메트로센터 30채널", "메트로센터 31채널", "메트로센터 32채널", "메트로센터 33채널", "메트로센터 34채널",
    "메트로센터 35채널", "메트로센터 36채널", "메트로센터 37채널", "메트로센터 38채널", "메트로센터 39채널",
    "메트로센터 40채널", "메트로센터 41채널", "메트로센터 42채널", "메트로센터 43채널", "메트로센터 44채널",
    "망자의 협곡 21채널", "망자의 협곡 22채널", "망자의 협곡 23채널", "망자의 협곡 24채널", "망자의 협곡 25채널",
    "이계던전 1채널", "이계던전 2채널", "이계던전 3채널", "이계던전 4채널", "이계던전 5채널",
    "이계던전 6채널", "이계던전 7채널", "이계던전 8채널", "이계던전 9채널", "이계던전 10채널",
    "고대던전 21채널", "고대던전 22채널", "고대던전 23채널", "고대던전 24채널", "고대던전 25채널",
    "경매장 61채널", "경매장 62채널"
];

const kasiyas = [
    "일반 경매장 29채널", "일반 27채널", "일반 28채널"
];

const kain = [
    "일반 경매장 65채널", "일반 63채널", "일반 64채널"
];

const healder = [
    "일반 경매장 28채널", "일반 26채널", "일반 27채널"
];

const siroco = [
    "일반 경매장 28채널", "일반 26채널", "일반 27채널"
];

const anton = [
    "일반 경매장 23채널", "일반 21채널", "일반 22채널"
];
const pray = [
    "일반 경매장 28채널", "일반 26채널", "일반 27채널"
];
const bacal = [
    "일반 경매장 5채널", "일반 52채널", "일반 53채널"
];
const diresie = [
    "일반 경매장 23채널", "일반 21채널", "일반 22채널"
];

let Bot = {};

Bot.choseChannel = (server) => {
    let tempArray = sharedChannel;
    let selectedChannel;
    console.log(server);
    switch (server) {
        case "디레지에" :
            for(let item of diresie) {
                tempArray.push(item);
            }
            break;
        case "바칼" :
            for(let item of bacal) {
                tempArray.push(item);
            }
            break;
        case "프레이" :
            for(let item of pray) {
                tempArray.push(item);
            }
            break;
        case "안톤" :
            for(let item of anton) {
                tempArray.push(item);
            }
            break;
        case "시로코" :
            for(let item of siroco) {
                tempArray.push(item);
            }
            break;
        case "힐더" :
            for(let item of healder) {
                tempArray.push(item);
            }
            break;
        case "카인" :
            for(let item of kain) {
                tempArray.push(item);
            }
            break;
        case "카시야스" :
            for (let item of kasiyas) {
                tempArray.push(item);
            }
            break;
    }
    selectedChannel = tempArray[Math.floor((Math.random() * tempArray.length) + 1 )];

    return selectedChannel;

};

module.exports = Bot;